'''
Изначально - 3 кнопки:
1 - начать игру
2 - настройки
3 - закончить игру

начать игру:
спрашивать ник
предыстория
обучение

'''

print('━'*31)
print('         ┃         _          ┃')
print('         ┃        ╱ ╲         ┃')
print('         ┃       ╱   ╲        ┃')
print('         ┃      ╱     ╲       ┃')
print('         ┃      │     │       ┃')
print('         ┃      |  [] |       ┃')
print('         ┃      |     |       ┃')
print('         ┃      |  [] |       ┃')
print('         ┃     /       \      ┃')
print('         ┃    /         \     ┃')
print('         ┃   /           \    ┃')
print('━'*31)
